# Transposing a dataframe in pandas

### Imports

In [1]:
%matplotlib inline

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

### Creating a dataframe

In [2]:
data = {"oranges":[5,3,33,12], "pears":[8,2,34,1], "bananas":[1,23,23,123], "kiwis":[0,12,23,23]}

df = pd.DataFrame(data, index = ["d1","d2","d3","d4"])
df

    bananas  kiwis  oranges  pears
d1        1      0        5      8
d2       23     12        3      2
d3       23     23       33     34
d4      123     23       12      1

### Transposing it

In [3]:
df.T

         d1  d2  d3   d4
bananas   1  23  23  123
kiwis     0  12  23   23
oranges   5   3  33   12
pears     8   2  34    1